In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name" : ['Prashant' , 'Rohan' , 'Skillf' , 'Shubh'],
    "Marks" : [88,66,77,44],
    "City" : ['Rampur' , 'Kolkata' , 'Jaipur' , 'Kanpur']
}

In [3]:
df1 = pd.DataFrame(dict1)                                       # DataFrame Convert data in Excel sheet for fast indexing
df1

       name  Marks     City
0  Prashant     88   Rampur
1     Rohan     66  Kolkata
2    Skillf     77   Jaipur
3     Shubh     44   Kanpur

In [4]:
df1.to_csv('pandasin1videodata.csv')                              # Export data to csv

In [6]:
df1.to_csv('pandasin1video_data_without_index.csv' , index=False)

In [7]:
df1.head(2)                                                       # Show Above 2 Rows in df1

       name  Marks     City
0  Prashant     88   Rampur
1     Rohan     66  Kolkata

In [8]:
df1.tail(2)                                                       # Show Below 2 Rows in df1

     name  Marks    City
2  Skillf     77  Jaipur
3   Shubh     44  Kanpur

In [9]:
df1.describe()                                                     # It does some general calculation of only numerical column

           Marks
count   4.000000
mean   68.750000
std    18.786076
min    44.000000
25%    60.500000
50%    71.500000
75%    79.750000
max    88.000000